app/views/users/_user.html.erb

	<%= link_to user.name, user %>
	(<%= user.microposts.count %>)
---
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 1]]