app/controllers/microposts_controller.rb

  def create
  	@micropost = current_user.microposts.new(micropost_params)
  	if @micropost.save
---
INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Example post in my own form"], ["user_id", 1], ["created_at", 2017-08-24 00:10:30 UTC], ["updated_at", 2017-08-24 00:10:30 UTC]]