app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ? ORDER BY "microposts"."created_at" DESC LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 37]]
---
  	def show
  		@user = User.find(params[:id])
      @microposts = @user.microposts.order(created_at: :desc).paginate(page: params[:page])

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "remember_token") VALUES (?, ?, ?, ?, ?, ?)
---
  	def create
  		@user = User.new(user_params)
  		if @user.save

UPDATE "users" SET "name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "fifth user1"], ["password_digest", "$2a$10$CqIF4knKqOF2IFzT/4I41OcLa8VEWbcYHEVV/.aR2JT5dn8/1AbdO"], ["updated_at", 2017-03-03 17:19:49 UTC], ["id", 6]]
---
  	def update
#      @user = User.find(params[:id])
      if @user.update_attributes(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]
---
  	def destroy
      user = User.find(params[:id])
      deleted = user.name
      user.destroy